gian793/stm32h7-cppLibrary/cmdCtrl/cmdCtrl.cpp
/**
 * \file            cmdCtrl.cpp
 * \brief           Controller for sending and receiving commands asynchronously.
 * \author          giancarlo.marcolin@gmail.com
 */

#include <algorithm>
#include <array>
#include <cstdint>

#include "stm32_lock.h"
#include "cmdConfig.h"
#include "cmd.h"
#include "cmdCtrl.h"


/**
  * @brief  Commands handler. Must be invoked periodically.
  * @param  None.
  * @retval True if any command is handled.
  */

bool cmdCtrl::Manager( void )
{
    stm32_lock_acquire( &cmdLock );

    /* Commands Tx. */
    auto idx = txCnt;

    while( idx > 0 )
    {
        --idx;
        txBuffer[ idx ].execute(); 
    }

    stm32_lock_release( &cmdLock );

    return true;
}



/**
  * @brief  Transmit a command.
  * @param  Command to be transmitted.
  * @retval True if command added successfully to tx buffer.
  */

bool cmdCtrl::Load( Cmd &xCmd )
{
    bool isCmdAdded = false;

    stm32_lock_acquire( &cmdLock );

    auto idx = txCnt;

    while( idx > 0 )
    {
        --idx;
    
        /* Is this a reply? */
        if( txBuffer[ idx ].type  == xCmd.type && 
            txBuffer[ idx ].token == xCmd.token )
        {
            txBuffer[ idx ].replied();
        }
    }

    if( txCnt < txBuffer.max_size() ) 
    {
        xCmd.init( ++nextToken );

        txBuffer[ txCnt++ ] = xCmd;

        /* Low priority cmds first. */
        std::sort( txBuffer.begin(), txBuffer.begin() + txCnt, Cmd::prioritySmallerEqual );

        isCmdAdded = true;
    }      

    stm32_lock_release( &cmdLock );

    return isCmdAdded;
}